const obj = {
  verb: {
    simple: {
      type1: ['َ', 'َ', 'َ'],
      maps: {
      	type1 : {
      		maadhi : [2,2],
      		mudari : [2,4,1]
      	},
      	type2 : {
      		maadhi : [2,2],
      		mudari : [2,4,3]
      	},
      	type3 : {
      		maadhi : [2,3],
      		mudari : [2,4,2]
      	},
      	type4 : {
      		maadhi : [2,2],
      		mudari : [2,4,2]
      	},
      	type5 : {
      		maadhi : [2,1],
      		mudari : [2,4,1]
      	},
      	type6 : {
      		maadhi : [2,3],
      		mudari : [2,4,3]
      	},
     	passive : {
	  		maadhi: [1,3],
      		mudari: [1,4,2]
      	},
  		enders : {
  			maadhi: [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]],
  			mudari: [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
  		}
      },
      beginnings: {
    	maadhi: ['','','','','','','','','','','','','',''],
      	mudari: ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن']
      },
      endings: {
       maadhi : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا'],
       mudari: ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
   	  }
    },
  },
};

export default obj;
