const obj = {
  verb: {
    simple: {
      type1: ['َ', 'َ', 'َ'],
      maps: {
      	type1 : {
      		maadhi : {
            vowels : {
              beginning : [2,2],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,1],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
      	},
      	type2 : {
          maadhi : {
            vowels : {
              beginning : [2,2],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,3],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
      	},
      	type3 : {
          maadhi : {
            vowels : {
              beginning : [2,3],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,2],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
      	},
      	type4 : {
          maadhi : {
            vowels : {
              beginning : [2,2],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,2],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },    
      	},
      	type5 : {
          maadhi : {
            vowels : {
              beginning : [2,1],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,1],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
      	},
      	type6 : {
          maadhi : {
            vowels : {
              beginning : [2,3],
              passive: [1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,3],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
      	},
      },
    },
    advanced: {
      maps: {
        type1 : {
          maadhi : {
            vowels : {
              beginning : [2,4,2],
              passive : [1,4,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['أ','أ','أ','أ','أ','أ','أ','أ','أ','أ','أ','أ','أ','أ'],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [1,4,3],
              passive : [1,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
        type2 : {
          maadhi : {
            vowels : {
              beginning : [2,52],
              passive : [1,53],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['','','','','','','','','','','','','',''],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [1,2,53],
              passive : [1,2,52],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ي','ي','ي','ت','ت','ي','ت','ت','ت','ت','ت','ت','ا','ن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
        type3 : {
          maadhi : {
            vowels : {
              beginning : [2,0,2],
              passive : [1,0,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['bا','bا','bا','bا','bا','bا','bا','bا','bا','bا','bا','bا','bا','bا'],
              passive : ['bو','bو','bو','bو','bو','bو','bو','bو','bو','bو','bو','bو','bو','bو'],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [1,2,0,3],
              passive : [1,2,0,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['يbا','يbا','يbا','تbا','تbا','يbا','تbا','تbا','تbا','تbا','تbا','تbا','اbا','نbا'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
        type4 : {
          maadhi : {
            vowels : {
              beginning : [3,4,2,2],
              passive : [1,4,1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت'],
              passive : ['اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت','اbت'],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,2,3],
              passive : [1,4,2,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['يbت','يbت','يbت','تbت','تbت','يbت','تbت','تbت','تbت','تbت','تbت','تbت','اbت','نbت'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
        type5 : {
          maadhi : {
            vowels : {
              beginning : [3,4,2,4,2],
              passive : [1,4,1,4,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['است','است','است','است','است','است','است','است','است','است','است','است','است','است'],
              passive : ['است','است','است','است','است','است','است','است','است','است','است','است','است','است'],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,2,4,3],
              passive : [1,4,2,4,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['يست','يست','يست','تست','تست','يست','تست','تست','تست','تست','تست','تست','است','نست'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
        type6 : {
          maadhi : {
            vowels : {
              beginning : [3,4,2,2],
              passive : [1,4,1,3],
              end : [[2], [0,2], [1], [2,4], [2,2], [4,2], [4,2], [4,1,2], [4,1,4], [4,3], [4,1,2], [4,1,5,2], [4,1], [4,2]]
            },
            letters : {
              beginning : ['ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان'],
              passive : ['ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان','ان'],
              end : ['','ا','وا','ت','تا','ن','ت','تما','تم','ت','تما','تن','ت','نا']
            }
          },
          mudari : {
            vowels : {
              beginning : [2,4,2,3],
              passive : [1,4,2,2],
              end : [[1], [2,0,3], [1,0,2], [1], [2,0,3], [4,2], [1], [2,0,3], [1,0,2], [3,0,2], [2,0,3], [4,2], [1], [1]]
            },
            letters : {
              beginning : ['ين','ين','ين','تن','تن','ين','تن','تن','تن','تن','تن','تن','ان','نن'],
              end : ['','ان','ون','','ان','ن','','ان','ون','ين','ان','ن','','']
            }
          },
        },
      },
    }
  },
};

export default obj;
